<template>
  <div>
    <div class="b-h1 q-mb-lg">Аккордеон</div>
    <b-accordion title="Госпитализация экстренная">
      Проведение сложных кардиохирургических операций: <br /><br />

      Экстренные кардиохирургические операции, включая необходимые медикаменты и
      расходные материалы, проводимые в экстренных случаях по жизненным
      показаниям, включая экстренную коронароангиографию и коронарную(баллонную)
      ангиопластику со стентированием по жизненным показаниям при остром
      коронарном синдроме с оплатой расходных материалов;<br /><br />

      Плановые кардиохирургические вмешательства, в том числе аортокоронарное
      шунтирование, стентирование (без оплаты стоимости стента);<br /><br />

      Аорто-коронарное шунтирование в экстренных ситуациях (при угрозе жизни) с
      оплатой расходных материалов.<br /><br />

      Проведение сложных нейрохирургических операций (с применением микроскопа)
      по плановым и экстренным показаниям (с оплатой дополнительных расходных
      материалов в экстренных ситуациях(при угрозе жизни)).
    </b-accordion>
    <b-accordion title="Госпитализация экстренная">
      Проведение сложных кардиохирургических операций: <br /><br />

      Экстренные кардиохирургические операции, включая необходимые медикаменты и
      расходные материалы, проводимые в экстренных случаях по жизненным
      показаниям, включая экстренную коронароангиографию и коронарную(баллонную)
      ангиопластику со стентированием по жизненным показаниям при остром
      коронарном синдроме с оплатой расходных материалов;<br /><br />

      Плановые кардиохирургические вмешательства, в том числе аортокоронарное
      шунтирование, стентирование (без оплаты стоимости стента);<br /><br />

      Аорто-коронарное шунтирование в экстренных ситуациях (при угрозе жизни) с
      оплатой расходных материалов.<br /><br />

      Проведение сложных нейрохирургических операций (с применением микроскопа)
      по плановым и экстренным показаниям (с оплатой дополнительных расходных
      материалов в экстренных ситуациях(при угрозе жизни)).
    </b-accordion>
    <div class="q-mb-md">
      <pre class="q-mb-md" v-text="t1"></pre>
    </div>
  </div>
</template>

<script>
import BAccordion from "../components/b-accordion";

export default {
  name: "Accordion",
  components: {
    BAccordion,
  },
  data: function () {
    return {
      t1: `<b-accordion title="Госпитализация экстренная">
  Проведение сложных кардиохирургических операций: ...
</b-accordion>
<b-accordion title="Госпитализация экстренная">
  Проведение сложных кардиохирургических операций: ...
</b-accordion>
`,
    };
  },
  methods: {},
};
</script>

<style scoped></style>
