<template>
  <div>
    <div class="b-h1 q-mb-lg">Модальные окна</div>

    <div class="q-mb-lg">
      <b-button @click="onClick">Открыть попап</b-button>
    </div>

    <!--    <b-modal maximized>-->
    <!--      <template slot="title">Заголовок попапа максимум две строки</template>-->
    <!--      Основной текст попапа, может быть в несколько строчек-->
    <!--      <template slot="bottom">-->
    <!--        <b-button block class="test">Submit</b-button>-->
    <!--        <b-button block type="pale">Cancel</b-button>-->
    <!--      </template>-->
    <!--    </b-modal>-->
    {{ showModal1 }}
    <b-accordion title="Госпитализация экстренная">
      Проведение сложных кардиохирургических операций: <br /><br />

      Экстренные кардиохирургические операции, включая необходимые медикаменты и
      расходные материалы, проводимые в экстренных случаях по жизненным
      показаниям, включая экстренную коронароангиографию и коронарную(баллонную)
      ангиопластику со стентированием по жизненным показаниям при остром
      коронарном синдроме с оплатой расходных материалов;<br /><br />

      Плановые кардиохирургические вмешательства, в том числе аортокоронарное
      шунтирование, стентирование (без оплаты стоимости стента);<br /><br />

      Аорто-коронарное шунтирование в экстренных ситуациях (при угрозе жизни) с
      оплатой расходных материалов.<br /><br />

      Проведение сложных нейрохирургических операций (с применением микроскопа)
      по плановым и экстренным показаниям (с оплатой дополнительных расходных
      материалов в экстренных ситуациях(при угрозе жизни)).
    </b-accordion>
    <b-accordion title="Госпитализация экстренная">
      Проведение сложных кардиохирургических операций: <br /><br />

      Экстренные кардиохирургические операции, включая необходимые медикаменты и
      расходные материалы, проводимые в экстренных случаях по жизненным
      показаниям, включая экстренную коронароангиографию и коронарную(баллонную)
      ангиопластику со стентированием по жизненным показаниям при остром
      коронарном синдроме с оплатой расходных материалов;<br /><br />

      Плановые кардиохирургические вмешательства, в том числе аортокоронарное
      шунтирование, стентирование (без оплаты стоимости стента);<br /><br />

      Аорто-коронарное шунтирование в экстренных ситуациях (при угрозе жизни) с
      оплатой расходных материалов.<br /><br />

      Проведение сложных нейрохирургических операций (с применением микроскопа)
      по плановым и экстренным показаниям (с оплатой дополнительных расходных
      материалов в экстренных ситуациях(при угрозе жизни)).
    </b-accordion>
    <b-modal v-model="showModal1">
      123123123
      <b-button block type="pale">Cancel</b-button>
    </b-modal>
  </div>
</template>

<script>
import BModal from "../components/b-modal";
import BButton from "../components/b-btn";
import BAccordion from "../components/b-accordion";

export default {
  name: "Modals",
  components: {
    BModal,
    BButton,
    BAccordion,
  },
  data: function () {
    return {
      showModal1: false,
    };
  },
  methods: {
    onClick() {
      this.showModal1 = true;
    },
  },
};
</script>

<style scoped>
.test {
  margin-bottom: 12px;
}
</style>
